app/controllers/school_classes_controller.rb

  def create
    # binding.pry
    @schoolclass = SchoolClass.create(school_class_params)
---
INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "Software Engineering"], ["room_number", 10]]

  def update
    # binding.pry
    @schoolclass = SchoolClass.find(params[:id])
    @schoolclass.update(school_class_params)
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["id", 1]]