app/controllers/students_controller.rb

    def create
      # binding.pry
      @student = Student.create(student_params)
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["created_at", "2017-08-12 23:09:22.521854"], ["updated_at", "2017-08-12 23:09:22.521854"]]

    def update
      # binding.pry
      @student = Student.find(params[:id])
      @student.update(student_params)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2017-08-12 23:09:22.546484"], ["id", 1]]